app/controllers/request_controller.rb

  def list

    if current_user.is_beauty?
      @requests = Request.all
    else
      @requests = Request.find_all_by_user_id(current_user.id, :order => 'created_at DESC')
---
SELECT "requests".* FROM "requests" ORDER BY created_at DESC
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = 1 ORDER BY created_at DESC

  def create
    @request = Request.new(params[:request])
    @request.user_id = current_user.id
    @request.status = Request::EM_PROCESSAMENTO

    if has_requests_being_processed?
      redirect_to '/request/new', :notice => t(:ja_tem_pedido_sendo_processado)
    elsif @request.save
---
INSERT INTO "requests" ("address", "created_at", "is_phone", "price", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def approve
    puts(params[:request][:price])
    @request = Request.find(params[:id])
    @request.price = params[:request][:price]
    @request.status = Request::APROVADO

    if is_price_blank?
      redirect_to '/request/list', :notice => t(:faltou_informar_valor)
    elsif @request.save
      redirect_to '/request/list', :notice => t(:pedido_aprovado_sucesso)
    else
      @requests = Request.all
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "requests" SET "price" = '21', "status" = 'A', "updated_at" = '2013-03-17 04:27:45.312231' WHERE "requests"."id" = 1
SELECT "requests".* FROM "requests" ORDER BY created_at DESC

  def reject
    @request = Request.find(params[:id])
    @request.status = Request::RECUSADO

    @request.save
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT 1  [["id", "7"]]
UPDATE "requests" SET "status" = 'R', "updated_at" = '2013-03-17 16:10:01.309116' WHERE "requests"."id" = 7